#ifndef _ICC_CONFIG_H
#ifdef __cplusplus
extern "C" {
#endif
#define _ICC_CONFIG_H

/*IC卡配置文件关键字含义*/
#define NCN6001 (1)
#define AT83C26 (2)
#define TDA8023 (3)
#define DS8113  (4)
#define TDA8026 (5)
#define NCN8025 (6)

/* 版本描述 */

#define SM_VERSION_DATE "161209" 

/**
 * the list of percent machine model software version information and 
 * card sockets numbers.
 */
#define  EMV_TERMINAL_NUM       7
#define  SM_VERSION_SN          "309"
#define  SM_VERSION_FLAG        "R"

/**
 * Update List:
 * ----------------------------------------------------------------------------------------
 * 2012-06-19   [300]   xusan       create 
 * ----------------------------------------------------------------------------------------
 * 2013-11-14   [301]   tanbx       301 版本由Sxxx 送检代码使用
 * ----------------------------------------------------------------------------------------
 * 2013-12-25   [302]   xuwt        warm_reset时使用初始的di和fi 
									扩大ISO7816下的TS超时时间，兼容非标准卡
 * ----------------------------------------------------------------------------------------
 * 2014-05-25   [303]   xuwt   根据新的EMV L1测试更新协议部分
 * ----------------------------------------------------------------------------------------
 * 2014-08-14   [304]   xuwt   兼容TDA8026和NCN8025
 * ----------------------------------------------------------------------------------------
 * 2015-03-10   [305]   xuwt   修正TDA8026 同步卡操作问题
                               TDA8026的SAM卡TS超时改为由BCM5892的IC卡控制器给出，
                                   以兼容一些TS数据到来较晚的非标准SAM卡
                               允许IC卡资源口线配置上将不存在的线配置为-1
 * -----------------------------------------------------------------------------------------
 * 2015-06-20   [306]   xuwt   修改IC卡命令出错的返回码，现在需要判断命令出错是否是由卡
 							   被拔出引起
                               当卡被拔出时，将通道的状态设置为IDLE态
 * -----------------------------------------------------------------------------------------
 * 2015-08-27   [307]   xuwt   为兼容新加坡wire card，增加T=0且etu < 93的高速卡的cgt的值
 *                             若通道不存在，则不启动对应的控制器。以兼容用户卡或SAM卡不存在
 							   的情景。
 * -----------------------------------------------------------------------------------------
 * 2015-11-27   [308]   xuwt   未发布。修改SAM卡warm_reset的一个bug。
 * 2016-07-12           wanls  未发布。增加sam卡通道切换芯片的关闭和使能的控制，解决SAM通道
 *                             切换时，I/O电平波动的问题。
 * 2016-08-10           wanls  未发布。300增加sam卡通道，增加到6通道，采用2个TDA8026级联的方式
 *                             实现。
 * 2016-08-11           wanls  未发布。修改S300机型获取sam卡通道数配置部分的代码，使库同时兼容
 *                             老S300和新的6SAM卡S300
 * 2016-08-12           wanls  级联的第二个TDA8026在冷复位中增加清中断，并将未发布的版本合并
 *                             并将插卡背光显示相关函数移到Icc_device_configure.c里面
 * -----------------------------------------------------------------------------------------
 *2016-12-09			zhaoyj 更改卡片时钟频率，将原本的3MHz更改为现在的4MHz
 *-------------------------------------------------------------------------------------------
 */
#ifdef __cplusplus
}
#endif
#endif

